{
  "add_router_probs": false,
  "architectures": [
    "SwitchTransformersForConditionalGeneration"
  ],
  "auto_map": {
    "AutoModel": "modeling_switch_transformers.SwitchTransformersModel",
    "AutoModelForSeq2SeqLM": "modeling_switch_transformers.SwitchTransformersForConditionalGeneration"
  },
  "d_ff": 3072,
  "d_kv": 64,
  "d_model": 768,
  "decoder_sparse_step": 2,
  "decoder_start_token_id": 0,
  "dense_act_fn": "relu",
  "dropout_rate": 0.1,
  "encoder_sparse_step": 2,
  "eos_token_id": 1,
  "expert_capacity": 64,
  "feed_forward_proj": "relu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": false,
  "layer_norm_epsilon": 1e-06,
  "model_type": "switch_transformers",
  "num_decoder_layers": 12,
  "num_experts": 128,
  "num_heads": 12,
  "num_layers": 12,
  "num_selected_experts": 1,
  "num_sparse_decoder_layers": 6,
  "num_sparse_encoder_layers": 6,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "router_aux_loss_coef": 0.001,
  "router_bias": false,
  "router_dtype": "float32",
  "router_ignore_padding_tokens": false,
  "router_jitter_noise": 0.01,
  "router_type": "tokens_masked",
  "router_z_loss_coef": 0.001,
  "torch_dtype": "float32",
  "transformers_version": "4.25.0.dev0",
  "use_cache": true,
  "vocab_size": 32128
}
