{
  "architectures": [
    "ToyForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_toy.ToyConfig",
    "AutoModel": "modeling_toy.ToyModel",
    "AutoModelForCausalLM": "modeling_toy.ToyForCausalLM"
  },
  "clip_qkv": null,
  "dtype": "bfloat16",
  "eos_token_id": 50279,
  "hidden_act": "silu",
  "hidden_size": 1280,
  "initializer_range": 0.02,
  "intermediate_size": 40960,
  "max_position_embeddings": 4096,
  "model_type": "toy",
  "moe_intermediate_size": 640,
  "moe_layer_flag": [
    true,
    true,
    true,
    true,
    true,
    true,
    true,
    true
  ],
  "norm_topk_prob": false,
  "num_attention_heads": 10,
  "num_experts": 64,
  "num_experts_per_tok": 16,
  "num_hidden_layers": 8,
  "num_key_value_heads": 5,
  "num_shared_experts": null,
  "output_router_logits": false,
  "pad_token_id": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.01,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "vocab_size": 50304
}
