{
  "architectures": [
    "XverseForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_xverse.XverseConfig",
    "AutoModel": "modeling_xverse.XverseMoEModel",
    "AutoModelForCausalLM": "modeling_xverse.XverseForCausalLM"
  },
  "pad_token_id": 1,
  "bos_token_id": 2,
  "eos_token_id": 3,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 1728,
  "max_position_embeddings": 8192,
  "model_type": "xverse",
  "num_attention_heads": 32,
  "num_hidden_layers": 28,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "rope_theta": 500000,
  "moe_top_k": 6,
  "num_experts": 64,
  "num_shared_experts": 2,
  "output_router_logits": false,
  "router_aux_loss_coef": 0.01,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.38.2",
  "use_cache": true,
  "vocab_size": 100534
}
