{
  "_name_or_path": "GRIN-MoE",
  "architectures": [
    "GRIN-MoE"
  ],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_grinmoe.GRINMoEConfig",
    "AutoModel": "modeling_grinmoe.GRINMoEModel",
    "AutoModelForCausalLM": "modeling_grinmoe.GRINMoEForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 32000,
  "hidden_act": "silu",
  "hidden_dropout": 0.0,
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "input_jitter_noise": 0.01,
  "intermediate_size": 6400,
  "lm_head_bias": true,
  "max_position_embeddings": 4096,
  "model_type": "grinmoe",
  "num_attention_heads": 32,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "num_local_experts": 16,
  "output_router_logits": false,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.0,
  "router_jitter_noise": 0.01,
  "sliding_window": 2047,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.2",
  "use_cache": true,
  "vocab_size": 32064
}
